[
  {
    "path": "posts/capstone/",
    "title": "Master's Capstone Project",
    "description": "Team members: Connor Flynn, Mia Forsline, and Scout Leonard",
    "author": [
      {
        "name": "Alex Vand",
        "url": {}
      }
    ],
    "date": "2022-06-15",
    "categories": [],
    "contents": "\r\nAssessing potential environmental justice implications of U.S. food production.\r\nAs human populations grow, global food production to meet these increasing demands places strain on finite natural resources. The sustainability implications of food production vary by food system. Different food production types create various ranges of greenhouse gas emissions, spatial disturbance, freshwater use, and nutrient pollution. These environmental pressures vary spatially as well. Not only do these pressures have ecological impacts, but also impacts on human health and wellbeing.\r\nUnderstanding the spatial distribution of environmental pressures from food production can help to inform sustainable and just food production\r\nDeliverables & Products\r\nIn order to support our client, the National Center for Ecological Analysis and Synthesis (NCEAS), our team was tasked with the following:\r\nCreate a single processed dataset with metadata that summarizes the total environmental pressure burden from food production for each food type and each environmental pressure type, for each county in the U.S.\r\nDevelop visualizations to help understand pressure distributions and their co-occurrence with both positive and negative human health outcomes\r\nGenerate AI models to understand food production pressures in predicting health outcomes\r\n1. Processed dataset\r\nAt the beginning of our capstone project, the raw data from NCEAS contained hundreds of separate images that describe the geographic distribution of environmental pressures from food production. Each image separately describes a specific type of food production and specific environmental pressure from that food production. For example, one of these images could describe the distribution of greenhouse gas emissions from the production of eggs, and another might describe the use of freshwater during soy production. In this form, these separate image files are difficult to derive meaning or patterns from. Using tools like R and GitHub, our team worked to make a meaningful data format for analyzing county-level food pressure patterns in the U.S.\r\nFigure 1: Processed dataset.We subsetted the global data to our area of interest, the United States, and aggregated hundreds of these images into a single, tidy, rectangular dataset. This tabular dataset contains: for each county in the US, for each food type, and for each environmental pressure type (such as greenhouse gas emissions or water use), the environmental pressure from food production.\r\nThis example above shows just two rows of our processed, tabular data from Santa Barbara county, although our total processed dataset contains more than 330,000 summarized pressure values covering every county in the US.\r\n2. Visualizations\r\nMaps\r\nUsing the processed dataset, we created a series of maps that show how environmental pressure from food production varies by county across the US. This map below is one example that shows greenhouse gas emissions from all food production types for each county; with red indicating counties with higher emissions and blue representing counties with lower emissions. Maps like this one can be used to visualize the spatial distribution of environmental pressures from food production on the county level and compare exposure to pressures across regions.\r\nFigure 2: Map example showing greenhouse gas emissions due to U.S. food production by county.In addition to geographic maps, another visualization we created to study the relationship between food production and human health are correlation plots.\r\nCorrelation plots\r\nThis visual below is one way our team compared patterns of health outcomes as food production increases. The main takeaway from this correlation plot is that health outcomes in regions of high food production differ across states and regions.\r\nFigure 3: Correlation plot example.3. Random forest models\r\nVariable importance plot\r\nCurious to dig deeper into the patterns we observed in the correlation plots, we used a machine learning technique to better understand which variables are most important for predicting health outcomes. Below is a variable importance plot generated from a random forest model.\r\nFigure 4: Variable importance plot example.The NCEAS Food Systems Working Group is doing important work to investigate the spatial distribution of environmental pressures from global food production. We are excited to have contributed processed datasets that are ready to use for analysis; visualizations to explore patterns between food production and health; and random forest modelling to begin to understand the importance of proximity to food production in predicting health outcomes.\r\nAcknowledgements\r\nFaculty Advisors\r\nDr. Benjamin Halpern (NCEAS Executive Director),\r\nDr. Allison Horst (Bren School of Environmental Science & Management UCSB)\r\nExternal Advisors at NCEAS\r\nGage Clawson, Haley Epperly, Dr. Caitlin Fong, Dr. Melanie Frazier\r\nFurther Support\r\nNCEAS Food Systems Working Group, MEDS Cohort and Staff\r\n\r\n\r\n\r\n",
    "preview": "posts/capstone/images\\map_example.png",
    "last_modified": "2023-03-03T11:54:59-08:00",
    "input_file": {}
  },
  {
    "path": "posts/enso/",
    "title": "El Niño Southern Oscillation (ENSO)",
    "description": "Does ENSO have a significant, predictable cycle?",
    "author": [
      {
        "name": "Alex Vand",
        "url": {}
      }
    ],
    "date": "2021-12-10",
    "categories": [],
    "contents": "\r\n\r\n\r\n# install packages\r\nlibrary(tidyverse)\r\nlibrary(tsibble)\r\nlibrary(zoo)\r\nlibrary(feasts)\r\n\r\n\r\nBackground\r\nEl Niño Southern Oscillation (ENSO) is a repeated climate pattern involving the warming and cooling of water temperature in the central and eastern tropical Pacific Ocean, coupled with changes in atmospheric pressure\\(^{[1]}\\). As shown in Figure 1, “El Niño” and “La Niña” represent the extreme phases of the ENSO cycle, where El Niño is the warming extreme and La Niña is the cooling extreme.\r\nFigure 1: Extreme phases of ENSO.The effects of ENSO vary depending on the particular phase: El Niño, La Niña, or a neutral phase\\(^{[3]}\\). During an El Niño warming event, Canada and the norther U.S. become drier and warmer, while the Gulf Coast and Southeast become wetter and more susceptible to flooding (see Figure 2). At the same time, southern Africa becomes dry and warm, shown in Figure 3. On the other end of the spectrum, during a La Niña cooling event, the Pacific Northwest and Canada experience heavy rains and flooding, while the southern U.S. experiences drought. During La Niña Southern Africa becomes wet and cool. These effects can be visualized in the graphics below.\r\nFigure 2: ENSO climate effect on North America.Figure 3: ENSO climate effect on African continent.ENSO has been well documented for centuries and varying research suggests that there is a repeated pattern of SST and atmospheric pressure anomalies that cycle in 2-10 year intervals\\(^{[4]}\\). While there is variability in the literature regarding occurrence of ENSO, this study hopes to use NOAA data to shed some light on the statistical significance of the ENSO cycle.\r\nMotivation\r\nThe climate phenomenon known as ENSO has a powerful influence on global processes. For example, major weather events, such as wildfire and hurricanes, are affected by the ENSO cycle\\(^{[6]}\\) due to large-scale changes in temperature and pressure. Furthermore, by influencing regional weather patterns, ENSO affects worldwide crop yields and agricultural outputs, leading to major implications for the global food system, such as under-nutrition in the global tropics\\(^{[7]}\\). Additionally, variations in sea surface temperatures associated with ENSO have implications for phytoplankton productivity and for fish, resulting in major economic impacts on fishing nations, such as Ecuador and Peru\\(^{[8]}\\).\r\nThe ability to scientifically and accurately predict the phases of ENSO allows for proactive global efforts in response to weather events, economic shifts, and even future human health hazards. The results of this study aim to inform policy and global preparedness regarding agriculture, the economy, human health, and climate change.\r\nData\r\nThis study analyzed free and open source data from NOAA’s National Weather Service Climate Prediction Center. Monthly atmospheric and sea surface temperature (SST) indices were collected over nearly 40 years. Measurements of SST anomalies (in degrees Celsius) are used to examine El Niño Southern Oscillation from January 1982 to October 2021 from four different regions across the equatorial Pacific. As shown in Figure 4, the four regions span from east to west, starting with Niño 1+2 at the western coast of South America.\r\nFigure 4: The four regions of interest across the equatorial Pacific where SST anomalies are measured.\r\n\r\n# read in the raw data (.csv from NOAA)\r\ndata_raw_enso <- read_csv(\"enso_data_raw_1982.csv\")\r\n\r\ndata_enso <- janitor::clean_names(data_raw_enso)\r\n\r\n\r\nAnalysis and Results\r\nLag Analysis\r\nStatistical lag analysis is implemented using the autocorrelation function acf, where the maximum lag duration (in months) is set for the entire time series of the available data. The graphs below represent the autocorrelation of SST anomalies across each of the four regions of the Pacific impacted by ENSO.\r\n\r\n\r\nacf1_2 <- acf(x = data_enso$anom1_2, lag.max = 478,\r\n            main = \"Niño 1+2\")\r\n\r\n\r\n\r\nThe graph above displays autocorrelation of SST anomalies for region Niño 1+2, which is the most eastern of the four regions, closest to the coast of South America. Values outside of the blue dotted lines indicate statistically significant autocorrelation among sea surface temperature within the region. We can see that between 0 and 200 lag months (<17 years) there are several significant values. Next, we examine the data for the other regions to see how the autocorrelation compares to Niño 1+2.\r\n\r\n\r\nacf3 <- acf(x = data_enso$anom3, lag.max = 478,\r\n            main = \"Niño 3\")\r\n\r\n\r\n\r\n\r\n\r\nacf3_4 <- acf(x = data_enso$anom3_4, lag.max = 478,\r\n            main = \"Niño 3.4\")\r\n\r\n\r\n\r\n\r\n\r\nacf4 <- acf(x = data_enso$anom4, lag.max = 478,\r\n            main = \"Niño 4\")\r\n\r\n\r\n\r\nAs expected, after plotting the acf function for Niño 3, 3.4, and 4, distinct similar patterns are revealed regarding where there is statistically significant SST anomaly lag. Because most of the interesting values across all regions seem to fall within 300 months (25 years), we take a closer look at this time period across the most studied region: Niño 3.4.\r\n\r\n\r\nacf3_4 <- acf(x = data_enso$anom3_4, lag.max = 300,\r\n            main = \"Niño 3.4\")\r\n\r\n\r\n\r\nHere we see statistically significant lag effects around the following times: \\(t-25\\) (~2 years), \\(t-100\\) (~8 years), \\(t-125\\) (~10 years), and \\(t-175\\) (~15 years).\r\nThis preliminary analysis suggests a cyclical pattern where the sea surface temperature anomaly from about 2, 8, 10, and 15 years ago affects the current sea surface temperature anomaly. This outcome is mostly inline with the currently published literature\\(^{[4]}\\), however it’s possible there is an even more defined seasonal pattern.\r\nClassical Decomposition\r\nBecause there seems to be a statistically significant repeated pattern of the ENSO cycle, the next step is to determine whether there is clear seasonality and a significant trend in the long-term data. This analysis is carried out through a classical additive decomposition of the NOAA SST data.\r\n\r\n\r\n# convert to class date in order to create tsibble\r\ndata_enso <- data_enso %>% \r\n  mutate(month = case_when(\r\n    mon <= 9 ~ paste0(0, mon),\r\n    mon > 9 ~ paste0(mon))) %>%\r\n  unite(col = date, yr, month, sep = \"-\") %>% \r\n  mutate(date = yearmonth(as.yearmon(date, format = '%Y-%m'))) %>%\r\n  na.omit() %>%\r\n  select(date, anom3_4) %>% \r\n  as_tsibble(index = date)\r\n\r\n\r\n\r\n\r\ndata_enso %>%\r\n  model(classical_decomposition(anom3_4, type = \"additive\")) %>%\r\n  components() %>%\r\n  autoplot() +\r\n  labs(title = \"Classical additive decomposition of ENSO SST anomalies\")\r\n\r\n\r\n\r\nAs shown in the graph above, the magnitude indicators on the vertical axes indicate the significance of each effect relative to the other components. A large bar indicates a low influence compared to a component with a small bar. According to this decomposition, there appears to be a very quick seasonal pattern, however this seasonality does not have a large influence on ENSO. Alternatively, the trend component does have a major influence although this pattern initially seems less defined. However, looking more closely at the trend component, a repeated pattern every decade or so can be seen across time (shown between 1988 and 2008, for example). This implies that there may be some other “seasonality” that the function is not currently identifying and further research is required.\r\nFuture Research\r\nFuture research aims to expand upon this preliminary analysis of ENSO autocorrelation and seasonality to accurately predict and prepare for major global impacts. To further explore long-term seasonality, the acf function used in the lag analysis may be manipulated to search for seasonality on a greater time scale, such as each decade. While this particular study focuses on SST anomalies, subsequent studies may apply this analysis to atmospheric pressure (the Southern Oscillation) in order to determine if there is a more predictable pattern for other ENSO indices. Additionally, regressing this data with crop yield data could lead to discoveries regarding which crops are El Niño vs. La Niña tolerant, informing major agricultural and food distribution decisions. This study hopes to proactively inform policy and global responses regarding the implications of the ENSO phenomenon.\r\nReferences\r\n1.What is the El Niño–Southern Oscillation (ENSO) in a nutshell? | NOAA Climate.gov. https://www.climate.gov/news-features/blogs/enso/what-el-ni%C3%B1o%E2%80%93southern-oscillation-enso-nutshell.\r\n2.US Department of Commerce, N. What is ENSO? https://www.weather.gov/mhx/ensowhat.\r\n3.US Department of Commerce, N. O. and A. A. What are El Nino and La Nina? https://oceanservice.noaa.gov/facts/ninonina.html.\r\n4.Philander, S. G. H. El Niño Southern Oscillation phenomena. Nature 302, 295–301 (1983).\r\n5.Allan, R., Lindesay, J. & Parker, D. El Nino Southern Oscillation and climatic variability. Oceanographic Literature Review 6, 555 (1997).\r\n6.Fasullo, J. T., Otto-Bliesner, B. L. & Stevenson, S. ENSO’s Changing Influence on Temperature, Precipitation, and Wildfire in a Warming Climate. Geophysical Research Letters 45, 9216–9225 (2018).\r\n7.Anttila-Hughes, J. K., Jina, A. S. & McCord, G. C. ENSO impacts child undernutrition in the global tropics. Nat Commun 12, 5785 (2021).\r\n8.Wang, C. & Fiedler, P. C. ENSO variability and the eastern tropical Pacific: A review. Progress in Oceanography 69, 239–266 (2006).\r\n\r\n\r\n\r\n",
    "preview": "posts/enso/enso_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-12-09T14:45:39-08:00",
    "input_file": {}
  }
]
